<script setup lang="ts"></script>

<template>
    <Head title="Почетна" />
    <Toaster richColors />

    <div class="flex min-h-screen flex-col items-center justify-center gap-3 bg-[#054A29] px-5">
        <div class="w-[150px] lg:w-[200px]">
            <svg width="100%" height="auto" viewBox="0 0 250 254" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path
                    d="M171.484 216.118C160.182 227.139 149.133 238.449 137.758 249.397C130.356 255.576 121.292 255.432 113.745 249.578L64.8169 202.062C62.1087 199.821 59.4366 198.376 55.7535 199.171C52.4314 199.894 50.7342 203.652 49.2177 206.362C43.6929 216.19 40.4791 227.03 29.0324 231.692C15.0942 237.401 -6.10212 231.8 1.66142 212.974C22.4244 170.914 42.6457 128.565 63.4087 86.5047C74.711 63.6318 85.8327 39.6749 97.8933 17.3078C105.404 3.3962 118.801 -3.25248 134.508 1.55336C146.424 5.20291 150.649 13.9835 155.993 24.1372C184.701 78.6997 211.241 135.683 238.179 191.221C241.79 198.665 250.745 212.974 249.95 220.815C248.289 236.75 225.143 236.281 215.213 228.331C206.402 221.249 205.03 210.77 198.928 202.712C196.4 199.388 193.222 198.268 189.25 199.857C185.567 201.339 175.095 212.685 171.484 216.226V216.118ZM125.011 46.5765C124.145 46.6488 123.206 47.2269 122.881 48.058L103.562 89.0341C103.707 90.2627 104.321 91.8526 105.621 92.25L143.03 92.4307C147.797 91.1299 146.93 88.8896 145.449 85.3123C140.214 72.9905 133.461 61.0302 128.261 48.6723C127.72 47.4437 126.456 46.4681 125.084 46.6126L125.011 46.5765ZM92.188 126.83C63.1198 129.649 53.8758 164.771 72.3999 185.801C87.4937 202.929 106.812 217.925 122.231 234.944C124.975 237.076 126.492 236.425 128.911 234.402C140.827 224.501 151.516 210.445 163.576 200.436C171.809 191.438 182.462 184.32 186.217 172.143C194.992 143.85 169.426 118.267 141.261 129.324C133.172 132.503 130.608 136.587 125.77 143.091C125.553 143.38 125.445 143.813 124.939 143.705C124.434 143.597 122.556 140.092 122.014 139.405C114.937 130.408 103.635 125.71 92.188 126.83Z"
                    fill="#5BBA6F"
                />
            </svg>
        </div>
        <div class="mb-10 text-center text-white">
            <div class="text-[32px] font-bold lg:text-[60px]">A D R I J A N</div>
            <div class="text-[18px] font-normal lg:text-[22px]">F O U N D A T I O N</div>
        </div>

        <p class="text-center text-[18px] leading-[1.2] font-bold text-white lg:text-[26px]">
            Да внесеме топлина таму каде што е студено.<br />
            - Адријан Живков
        </p>
        <p class="mx-auto max-w-[900px] text-center text-[12px] font-medium text-white lg:text-[20px]">
            Фондацијата е создадена со љубов и почит кон неговата светлина и живот. Нашата мисија е да донесеме надеж и поддршка таму каде што
            најмногу недостига – кај луѓе што се соочуваат со болест, неправда или тежок животен предизвик.
        </p>
    </div>
</template>
